Revit 2027 API
BuildingPad.GetBoundary Method
 Gets the boundary of current BuildingPad element.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetBoundary()
Public Function GetBoundary As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetBoundary()
member GetBoundary : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
 The curve loops that represent the boundary of the BuildingPad.
See Also
Reference
BuildingPad Class
Autodesk.Revit.DB.Architecture Namespace